<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Mozilla CA Certificate Store.</string>
    <key>Identifier</key>
    <string>co.luisrivera.download.MozillaCAStore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MozillaCAStore</string>
        <key>CURL_URL</key>
        <string>https://curl.haxx.se/ca/cacert.pem</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>CURLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%CURL_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
